-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Sep 18, 2024 at 12:52 PM
-- Server version: 10.4.32-MariaDB
-- PHP Version: 8.2.12

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `record`
--

-- --------------------------------------------------------

--
-- Table structure for table `transactions`
--

CREATE TABLE `transactions` (
  `id` int(11) NOT NULL,
  `type` enum('income','expense') NOT NULL,
  `name` varchar(255) NOT NULL,
  `amount` decimal(10,2) NOT NULL,
  `transaction_date` date NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `transactions`
--

INSERT INTO `transactions` (`id`, `type`, `name`, `amount`, `transaction_date`, `created_at`, `updated_at`) VALUES
(5, 'expense', 'test', 2000.00, '2567-08-15', '2024-09-18 08:58:01', '2024-09-18 08:58:01'),
(6, 'income', 'test', 2000.00, '2024-09-17', '2024-09-18 08:58:41', '2024-09-18 08:58:41'),
(7, 'income', 'test01', 2000.50, '2024-09-17', '2024-09-18 09:06:35', '2024-09-18 09:07:25'),
(8, 'expense', 'ค่าน้ำ', 300.00, '2024-09-17', '2024-09-18 09:12:40', '2024-09-18 09:12:40'),
(9, 'income', 'รายได้จากการทำงาน', 2000.00, '2024-08-12', '2024-09-18 09:28:28', '2024-09-18 09:28:28'),
(10, 'income', 'ค่าใช้จ่าย', 200.00, '2024-08-20', '2024-09-18 09:28:45', '2024-09-18 09:28:45'),
(11, 'expense', 'เติมเงินเกม', 2000.00, '2024-08-20', '2024-09-18 09:29:01', '2024-09-18 09:29:01'),
(12, 'expense', 'เงินหักประกัน', 450.00, '2024-08-19', '2024-09-18 09:29:45', '2024-09-18 09:29:45'),
(13, 'expense', 'ค่าข้าว', 40.00, '2024-08-20', '2024-09-18 09:29:58', '2024-09-18 09:29:58'),
(14, 'income', 'เงินจากทำงาน', 3000.00, '2024-08-21', '2024-09-18 09:30:50', '2024-09-18 09:30:50'),
(15, 'expense', 'ค่าน้ำ', 300.00, '2024-08-21', '2024-09-18 09:31:00', '2024-09-18 09:31:00'),
(16, 'expense', 'ค่าอาหารแมว', 600.00, '2024-08-22', '2024-09-18 09:31:25', '2024-09-18 09:31:25'),
(17, 'expense', 'ค่าสนาม', 600.00, '2024-08-22', '2024-09-18 09:31:39', '2024-09-18 09:31:39'),
(18, 'income', 'ค่าสตีม', 4000.00, '2024-08-22', '2024-09-18 09:31:59', '2024-09-18 09:31:59'),
(19, 'expense', 'ค่าขนม', 500.00, '2024-08-23', '2024-09-18 09:32:18', '2024-09-18 09:32:18'),
(20, 'expense', '7-11', 200.50, '2024-08-23', '2024-09-18 09:32:48', '2024-09-18 09:32:48'),
(21, 'income', 'เงินเดือน', 20000.00, '2024-08-25', '2024-09-18 09:35:59', '2024-09-18 09:35:59'),
(22, 'expense', 'ค่าข้าว', 200.00, '2024-08-26', '2024-09-18 09:36:38', '2024-09-18 09:36:38'),
(23, 'expense', 'เลี้ยงบุฟเฟต์', 2000.00, '2024-08-26', '2024-09-18 09:37:08', '2024-09-18 09:37:08'),
(24, 'expense', 'ค่าเดินทาง', 600.00, '2024-08-27', '2024-09-18 09:38:07', '2024-09-18 09:38:07'),
(25, 'income', 'ถูกหวย', 20000.00, '2024-09-16', '2024-09-18 09:38:40', '2024-09-18 09:38:40'),
(26, 'income', 'test01', 2000.00, '2024-08-16', '2024-09-18 09:39:13', '2024-09-18 09:39:13'),
(27, 'income', 'เงินเดือน', 5000.00, '2024-09-03', '2024-09-18 09:41:43', '2024-09-18 10:20:26'),
(28, 'expense', 'เงินค่าชุด', 2700.00, '2024-09-13', '2024-09-18 09:42:05', '2024-09-18 09:42:05'),
(29, 'expense', 'ค่าไฟ', 1100.00, '2024-09-19', '2024-09-18 09:46:14', '2024-09-18 09:46:14'),
(30, 'income', 'เงินจากการลงทุน', 2000.00, '2024-09-20', '2024-09-18 09:46:49', '2024-09-18 09:46:49'),
(31, 'expense', 'ตัดค่าบัตร', 2000.00, '2024-09-20', '2024-09-18 09:47:17', '2024-09-18 09:47:17'),
(32, 'expense', 'ค่ายูทูป', 400.00, '2024-09-21', '2024-09-18 09:47:30', '2024-09-18 09:47:30'),
(33, 'income', 'เงินค่าขนมสัปดาห์', 2000.00, '2024-09-23', '2024-09-18 09:48:01', '2024-09-18 09:48:01'),
(34, 'income', 'ค่าบัตรคอนเสิร์ต', 3507.50, '2024-09-23', '2024-09-18 09:48:39', '2024-09-18 09:48:39'),
(35, 'income', '7-11', 206.50, '2024-09-24', '2024-09-18 09:49:01', '2024-09-18 09:49:01'),
(36, 'income', 'รางวัลการแข่งเกม', 4500.00, '2024-09-24', '2024-09-18 09:49:30', '2024-09-18 09:49:30'),
(37, 'income', 'เงินรางวัล', 500.00, '2024-09-25', '2024-09-18 10:00:48', '2024-09-18 10:00:48'),
(38, 'expense', 'ค่าข้าว', 300.00, '2024-09-26', '2024-09-18 10:01:08', '2024-09-18 10:01:08'),
(40, 'income', 'รายได้', 200.50, '2024-09-22', '2024-09-18 10:19:21', '2024-09-18 10:19:21'),
(41, 'income', 'รายได้', 3000.00, '2024-09-19', '2024-09-18 10:21:10', '2024-09-18 10:21:10'),
(43, 'income', 'รายจ่าย', 5000.00, '2024-09-25', '2024-09-18 10:21:41', '2024-09-18 10:21:41'),
(45, 'income', 'รายจ่าย01', 2000.00, '2024-08-19', '2024-09-18 10:22:59', '2024-09-18 10:22:59'),
(46, 'expense', 'รายจ่าย02', 300000.00, '2024-08-22', '2024-09-18 10:23:18', '2024-09-18 10:23:18'),
(47, 'income', 'เงินเดือน01', 7000.00, '2024-09-27', '2024-09-18 10:28:38', '2024-09-18 10:29:08');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `transactions`
--
ALTER TABLE `transactions`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `transactions`
--
ALTER TABLE `transactions`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=49;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
